app/views/links/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 5]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 5]]
---
<h3 class="comments_title">
  <%= @link.comments.count %> Comments