app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "youtube"], ["url", "https://www.youtube.com/"], ["user_id", 1], ["created_at", "2016-05-25 12:06:44.855153"], ["updated_at", "2016-05-25 12:06:44.855153"]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "title" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["title", "YouTube"], ["updated_at", "2016-05-25 12:07:34.292945"], ["id", 1]]